# Packages
brew "btop"
brew "coreutils"
brew "curl"
brew "doctl"
brew "fastfetch"
brew "fish"
brew "git"
brew "jemalloc"
brew "libpq"
brew "libyaml"
brew "mise"
brew "overmind"
brew "postgresql@17"
brew "rust"
brew "vips"
brew "wget"
brew "fzf"

# Cask applications
cask "1password"
cask "brave-browser"
cask "cork"
cask "cursor"
cask "discord"
cask "docker"
cask "ghostty"
cask "netnewswire"
cask "obsidian"
cask "orbstack"
cask "pearcleaner"
cask "raycast"
cask "rectangle"
cask "vlc"
cask "whatsapp"
cask "zoom"

# Fonts
cask "font-cascadia-code"
cask "font-cascadia-mono"
cask "font-dm-sans"
cask "font-fira-code"
cask "font-hack"
cask "font-ibm-plex-mono"
cask "font-ibm-plex-sans"
