# Packages
brew "zsh"
brew "mise"
brew "git"
brew "wget"
brew "htop"
brew "coreutils"
brew "libyaml"
brew "curl"
brew "jemalloc"
brew "rust"
brew "doctl"
brew "postgresql@15"
brew "vips"
brew "libpq"

# Cask applications
cask "cursor"
cask "ghostty"
cask "brave-browser"
cask "1password"
cask "rectangle"
cask "orion"
cask "raycast"
cask "obsidian"
cask "whatsapp"
cask "pearcleaner"
cask "cork"

# Fonts
cask "font-cascadia-mono"
cask "font-cascadia-code"
cask "font-hack"
cask "font-fira-code"
cask "font-ibm-plex-mono"
cask "font-ibm-plex-sans"
cask "font-dm-sans"
