aliariff.vscode-erb-beautify
bradlc.vscode-tailwindcss
dracula-theme-pro.theme-dracula-pro
enkia.tokyo-night
esbenp.prettier-vscode
foxundermoon.shell-format
ms-vscode-remote.remote-containers
rubocop.vscode-rubocop
sdras.night-owl
shopify.ruby-lsp
unifiedjs.vscode-mdx